{
  "main": {
    "name":"Nathan Brown",
    "occupation":"Web Developer",
    "description":"I am always seeking the advancement of my knowledge and career. Below is a brief rundown of my history and current skillset, please view my resume for more detailed info.",
    "image":"profilepic.png",
    "bio":"Atlanta born and raised, I have always strived to digest more knowledge. Naturally, I became facinated with computers and programming at a very early age and knew it would be my future career. The possibilities for the knowledge you can gain in this field is immense, and that makes me very happy. I would love to stay in contact with anyone reading this, make sure to connect with me on LinkedIn!",
    "contactmessage":"",
    "email": "nbrown1337@gmail.com",
    "phone": "404-754-****",
    "address":{
      "street":"2047 Dellwood Dr NW",
      "city":"Atlanta",
      "state":"Georgia",
      "zip": "30309"
    },
    "website": "http://www.onlyabout.me",
    "resumedownload":"http://www.onlyabout.me/resume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/nathan-brown-02b07313b/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/nbrown1337",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here is a ranking of my proficiency in certain languages / technologies:",
    "education":[
      {
        "school":"Gwinnett Technical College",
        "degree":"Associates in Computer Programming",
        "graduated":"April 2017 - 3.7 GPA",
        "description":"Took a deep dive in languages and technologies such as: Java, C++, C#, MySQL, Swift, Android Studio, wireframing, data structures, GUI and API development and more."
      }
    ],
    "work":[
      {
        "company":"Freud America Inc.",
        "title":"Senior Web Developer",
        "years":"November 2019 - Present",
        "description":"Managed our websites, both with updating the look and feel of our online product catalogs and by adding new features to our dealer and sales team portal. Our website was built on Laravel and VueJS, with MySQL and MongoDB; all hosted in the cloud.",
      },
      {
        "company":"You42",
        "title":"Web Developer",
        "years":"December 2018 - November 2019",
        "description":"Front end lead on both of our products we are working on, one being a content sharing platform like Pinterest, and the other being a content management platform for content creators who produce online videos. Used ReactJs, Laravel PHP, GoLand, MongoDB and MySQL.",
        "image": "images/loading.gif"
      },
      {
        "company":"BoardActive",
        "title":"Lead Developer",
        "years":"July 2016 - December 2017",
        "description":"Designed and developed a new, fully responsive website in React that conveys a clearer message and has a client dashboard for uploading and managing geofences and ad promotions. Served as technical Product Owner."
      },
      {
        "company":"Upventrix",
        "title":"Software Engineer",
        "years":"January 2018 - May 2018",
        "description":"Coded in Java, JavaScript (Node/Express.js), C#, and python to build various internal and client projects ranging from task/time management to automotive logistics applications."
      },
      {
        "company":"Blueprint RF",
        "title":"Senior Network Operations",
        "years":"June 2011 - March 2016",
        "description":"Provided the highest level of support for more than 2400 hotels and airports across the United States. (Marriott, IHG, Choice, Hyatt, PDK, ect.)"
      }
    ],
    "skills":[
      {
        "name":"ReactJs",
        "level":"95%"
      },
      {
        "name":"NodeJS/ExpressJS",
        "level":"90%"
      },
      {
        "name":"HTML",
        "level":"100%"
      },
      {
        "name":"CSS",
        "level":"98%"
      },
      {
        "name":"MySQL",
        "level":"90%"
      },
      {
        "name":"Swift/Android Studio",
        "level":"80%"
      },
      {
        "name":"Java",
        "level":"85%"
      },
      {
        "name":"C++/C#",
        "level":"75%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Freud Tools Online Catalog",
        "category":"Worked as a Senior Full Stack Developer to add new features and update the look and feel of Freud Tool's online product catalog. Built with VueJS and Laravel PHP.",
        "image":"freud.png",
        "url":"https://www.freudtools.com/explore/saw-blades"
      },
      {
        "title":"Studio42 Creator Content Managment Platform",
        "category":"I worked to create this creator/content management platform. Users could upload, manage, and view statistics of multiple content sharing platforms at once. We integrated with Youtube, Twitter, Facebook, Vimeo, and more. Built using React, GraphQL, Golang and MongoDB.",
        "image":"dashboard.png",
        "url":"https://www.freudtools.com/explore/saw-blades"
      },
      {
        "title":"You42 Content Sharing Platform",
        "category":"Worked as the Front End Lead on a creator-focused content sharing platform. I implemented nearly every design and fuction you still see today, from navbar to audio streaming. Built with React on Laravel PHP.",
        "image":"u42.png",
        "url":"https://www.you42.com/home"
      },
      {
        "title":"GigaLoan",
        "category":"Worked as part of a team to develop an Android, iOS, and Javascript Web Application. GigaLoan is used by students to find and accept odd jobs in their area. Payment upon completion of a task would go directly to the student’s education loans. (Image is of a testing page for the middleware during development)",
        "image":"gigaloan.png",
        "url":"https://github.com/nbrown1337/GigALoan"
      },
      {
        "title":"Node.js Weather Bot",
        "category":"Created a Node.js program that used Facebook’s messenger API to send information to users requesting data such as weather. Integrated the Node.js client with Wit AI in order to understand sentence structure and type of request. Currently, the bot provides up to date weather using several weather API calls.",
        "image":"chatbot.png",
        "url":""
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Time Person of the Year",
        "user":"Time Magazine - 2006"
      }
    ]
  }
}
